ROUTER 1

> enable
#configure terminal
ipv6 unicast-routing
()#interface g0/0
	no shutdown
	ip add 192.168.40.1 255.255.255.252
	ipv6 address FE80::1 link-local 
	ipv6 address 2001:db8:1::1/64
()#interface g0/0/0
	no shutdown
	ip add 10.0.0.2 255.255.255.0
	ipv6 address FE80::2 link-local 
    ipv6 address 2001:db8:2::1/64
()#interface serial 0/1/0
	No shutdown
	Ip add 10.0.0.5 255.255.255.252
	ipv6 address FE80::3 link-local 
    ipv6 address 2001:db8:3::1/64
()#interface serial 0/2/0
	No shutdown
	Ip add 10.0.0.18 255.255.255.252
	ipv6 address FE80::4 link-local 
    ipv6 address 2001:db8:4::1/64
()#interface serial 0/3/0
	No shutdown
	Ip add 10.0.0.21 255.255.255.252
	ipv6 address FE80::5 link-local 
    ipv6 address 2001:db8:5::1/64

()#ip route 
.
.
.

()#ipv6 route 
.
.
.


ROUTER 2

> enable
#configure terminal
ipv6 unicast-routing
()#interface g0/0
	no shutdown
	ip add 192.168.10.1 255.255.255.252
	ipv6 address FE80::6 link-local 
	ipv6 address 2001:db8:6::1/64
()#interface g0/0/0
	no shutdown
	ip add 10.0.0. 255.255.255.0
	ipv6 address FE80::7 link-local 
    ipv6 address 2001:db8:7::1/64
()#interface serial 0/1/0
	No shutdown
	Ip add 10.0.0.14 255.255.255.252
	ipv6 address FE80::8 link-local 
    ipv6 address 2001:db8:8::1/64
()#interface serial 0/2/0
	No shutdown
	Ip add 10.0.0.17 255.255.255.252
	ipv6 address FE80::9 link-local 
    ipv6 address 2001:db8:9::1/64
()#interface serial 0/3/0
	No shutdown
	Ip add 10.0.0.30 255.255.255.252
	ipv6 address FE80::10 link-local 
    ipv6 address 2001:db8:10::1/64

()#ip route 
.
.
.

()#ipv6 route 
.
.
.



ROUTER 3 

> enable
#configure terminal
ipv6 unicast-routing
()#interface g0/0
	no shutdown
	ip add 192.168.20.1 255.255.255.252
	ipv6 address FE80::11 link-local 
	ipv6 address 2001:db8:11::1/64
()#interface g0/0/0
	no shutdown
	ip add 10.0.0.10 255.255.255.0
	ipv6 address FE80::12 link-local 
    ipv6 address 2001:db8:12::1/64
()#interface serial 0/1/0
	No shutdown
	Ip add 10.0.0.13 255.255.255.252
	ipv6 address FE80::3 link-local 
    ipv6 address 2001:db8:13::1/64
()#interface serial 0/2/0
	No shutdown
	Ip add 10.0.0.26 255.255.255.252
	ipv6 address FE80::14 link-local 
    ipv6 address 2001:db8:14::1/64
()#interface serial 0/3/0
	No shutdown
	Ip add 10.0.0.29 255.255.255.252
	ipv6 address FE80::15 link-local 
    ipv6 address 2001:db8:15::1/64

()#ip route 
.
.
.

()#ipv6 route 
.
.
.


ROUTER 4

> enable
#configure terminal
ipv6 unicast-routing
()#interface g0/0
	no shutdown
	ip add 192.168.30.1 255.255.255.252
	ipv6 address FE80::16 link-local 
	ipv6 address 2001:db8:16::1/64
()#interface g0/0/0
	no shutdown
	ip add 10.0.0.9 255.255.255.0
	ipv6 address FE80::17 link-local 
    ipv6 address 2001:db8:17::1/64
()#interface serial 0/1/0
	No shutdown
	Ip add 10.0.0.6 255.255.255.252
	ipv6 address FE80::18 link-local 
    ipv6 address 2001:db8:18::1/64
()#interface serial 0/2/0
	No shutdown
	Ip add 10.0.0.25 255.255.255.252
	ipv6 address FE80::19 link-local 
    ipv6 address 2001:db8:19::1/64
()#interface serial 0/3/0
	No shutdown
	Ip add 10.0.0.22 255.255.255.252
	ipv6 address FE80::20 link-local 
    ipv6 address 2001:db8:20::1/64

()#ip route 
.
.
.

()#ipv6 route 
.
.
.
