ROUTER 1

> enable
#configure terminal
ipv6 unicast-routing
()#interface g0/0
	no shutdown
	ip add 10.0.0.2 255.255.255.252
	ipv6 address FE80::1 link-local 
	ipv6 address 2001:db8:1::1/64
()#interface g0/1
	no shutdown
	ip add 192.168.40.1 255.255.255.0
	ipv6 address FE80::2 link-local 
    ipv6 address 2001:db8:2::1/64
()#interface serial 0/0/0
	No shutdown
	Ip add 10.0.0.5 255.255.255.252
	ipv6 address FE80::3 link-local 
    ipv6 address 2001:db8:3::1/64

()#ip route 10.0.0.12 255.255.255.252 10.0.0.1
()#ip route 10.0.0.8 255.255.255.252 10.0.0.6

()#ip route 192.168.10.0 255.255.255.0 10.0.0.1 50
()#ip route 192.168.20.0 255.255.255.0 10.0.0.1 100
()#ip route 192.168.30.0 255.255.255.0 10.0.0.1 150

()#ip route 192.168.10.0 255.255.255.0 10.0.0.6 150
()#ip route 192.168.20.0 255.255.255.0 10.0.0.6 100
()#ip route 192.168.30.0 255.255.255.0 10.0.0.6 50

()#ipv6 route 
.
.
.


ROUTER 2

> enable
#configure terminal
()#interface g0/0
	no shutdown
	ip add 10.0.0.1 255.255.255.252
	ipv6 address FE80::4 link-local 
    ipv6 address 2001:db8:4::1/64
()#interface g0/1
	no shutdown
	ip add 192.168.10.1 255.255.255.0
	ipv6 address FE80::5 link-local 
    ipv6 address 2001:db8:5::1/64
()#interface serial 0/0/0
	no shutdown
	ip add 10.0.0.14 255.255.255.252
	ipv6 address FE80::6 link-local 
    ipv6 address 2001:db8:6::1/64

()#ip route 10.0.0.4 255.255.255.252 10.0.0.2
()#ip route 10.0.0.8 255.255.255.252 10.0.0.13 

()#ip route 192.168.20.0 255.255.255.0 10.0.0.2 50
()#ip route 192.168.30.0 255.255.255.0 10.0.0.2 100
()#ip route 192.168.40.0 255.255.255.0 10.0.0.2 150

()#ip route 192.168.20.0 255.255.255.0 10.0.0.13 150 
()#ip route 192.168.30.0 255.255.255.0 10.0.0.13 100 
()#ip route 192.168.40.0 255.255.255.0 10.0.0.13 50




ROUTER 3 

> enable
#configure terminal
()#interface g0/0
	no shutdown
	ip add 10.0.0.10 255.255.255.252
	ipv6 address FE80::9 link-local 
    ipv6 address 2001:db8:9::1/64
()#interface g0/1
	no shutdown
	ip add 192.168.20.1 255.255.255.0
	ipv6 address FE80::8 link-local 
    ipv6 address 2001:db8:8::1/64
()#interface serial 0/0/0
	no shutdown
	ip add 10.0.0.13 255.255.255.252
	ipv6 address FE80::7 link-local 
    ipv6 address 2001:db8:7::1/64
	
()#ip route 10.0.0.0 255.255.255.252 10.0.0.14
()#ip route 10.0.0.4 255.255.255.252 10.0.0.9

()#ip route 192.168.10.0 255.255.255.0 10.0.0.9 150
()#ip route 192.168.30.0 255.255.255.0 10.0.0.9 50
()#ip route 192.168.40.0 255.255.255.0 10.0.0.9 100

()#ip route 192.168.10.0 255.255.255.0 10.0.0.14 50
()#ip route 192.168.30.0 255.255.255.0 10.0.0.14 150
()#ip route 192.168.40.0 255.255.255.0 10.0.0.14 100




ROUTER 4

> enable
#configure terminal
()#interface g0/0
	no shutdown
	ip add 10.0.0.9 255.255.255.252
	ipv6 address FE80::10 link-local 
    ipv6 address 2001:db8:10::1/64
()#interface g0/1
	no shutdown
	ip add 192.168.30.1 255.255.255.0
	ipv6 address FE80::11 link-local 
    ipv6 address 2001:db8:11::1/64
()#interface serial 0/0/0
	no shutdown
	ip add 10.0.0.6 255.255.255.252
	ipv6 address FE80::12 link-local 
    ipv6 address 2001:db8:12::1/64

()#ip route 10.0.0.0 255.255.255.252 10.0.0.5
()#ip route 10.0.0.12 255.255.255.252 10.0.0.10

()#ip route 192.168.10.0 255.255.255.0 10.0.0.5 100
()#ip route 192.168.20.0 255.255.255.0 10.0.0.5 150
()#ip route 192.168.40.0 255.255.255.0 10.0.0.5 50

()#ip route 192.168.10.0 255.255.255.0 10.0.0.10 100
()#ip route 192.168.20.0 255.255.255.0 10.0.0.10 50
()#ip route 192.168.40.0 255.255.255.0 10.0.0.10 150

